mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/sdcard.c
        /* Flush data read during data write. */
        ROM_SSIDataGet(SDC_SSI_BASE, &ui32Dat);
    }

    // /* Revert to hardware control of the SSI TX line. */
    // ROM_GPIOPinTypeSSI(SDC_GPIO_PORT_BASE, SDC_SSI_TX);
    
}

/*-----------------------------------------------------------------------*/
/* Power Control  (Platform dependent)                                   */
/*-----------------------------------------------------------------------*/
/* When the target system does not support socket power control, there   */
/* is nothing to do in these functions and sd_chk_power always returns 1.   */
void sd_power_on (void) {
    /*
     * This doesn't really turn the power on, but initializes the
     * SSI port and pins needed to talk to the card.
     */

    /* Enable the peripherals used to drive the SDC on SSI */
    // ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    ROM_SysCtlPeripheralEnable(SDC_SSI_SYSCTL_PERIPH);
    ROM_SysCtlPeripheralEnable(SDC_GPIO_SYSCTL_PERIPH);

    /*
     * Configure the appropriate pins to be SSI instead of GPIO. The FSS (CS)
     * signal is directly driven to ensure that we can hold it low through a
     * complete transaction with the SD card.
     */

    GPIOPinConfigure(GPIO_PB4_SSI2CLK);
    // GPIOPinConfigure(GPIO_PB5_SSI2FSS);
    GPIOPinConfigure(GPIO_PB6_SSI2RX);
    GPIOPinConfigure(GPIO_PB7_SSI2TX);
    // ROM_GPIOPinTypeSSI(SDC_GPIO_PORT_BASE, SDC_SSI_TX | SDC_SSI_RX | SDC_SSI_CLK);
    // ROM_GPIOPinTypeGPIOOutput(SDC_GPIO_PORT_BASE, SDC_SSI_FSS);
    // ROM_GPIOPinTypeGPIOOutput(SDC_GPIO_PORT_BASE, MICROPY_HW_SDCARD_DETECT_PIN->pin_mask);
    ROM_GPIOPinTypeSSI(SDC_GPIO_PORT_BASE, SDC_SSI_TX | SDC_SSI_RX | SDC_SSI_CLK);
    ROM_GPIOPinTypeGPIOOutput(SDC_GPIO_PORT_BASE, SDC_SSI_FSS);
    GPIOPinTypeGPIOInput(SDC_GPIO_PORT_BASE, MICROPY_HW_SDCARD_DETECT_PIN->pin_mask);
    GPIOPadConfigSet(SDC_GPIO_PORT_BASE, MICROPY_HW_SDCARD_DETECT_PIN->pin_mask, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD_WPU);

    /*
     * Set the SSI output pins to 4MA drive strength and engage the
     * pull-up on the receive line.
     */
    MAP_GPIOPadConfigSet(SDC_GPIO_PORT_BASE, SDC_SSI_RX, GPIO_STRENGTH_2MA,
                         GPIO_PIN_TYPE_STD_WPU);
    MAP_GPIOPadConfigSet(SDC_GPIO_PORT_BASE, SDC_SSI_CLK | SDC_SSI_TX | SDC_SSI_FSS,
                         GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD);
    

    /* Configure the SSI0 port */
    ROM_SSIConfigSetExpClk(SDC_SSI_BASE, ROM_SysCtlClockGet(),
                           SSI_FRF_MOTO_MODE_0, SSI_MODE_MASTER, 200000, 8);
    ROM_SSIEnable(SDC_SSI_BASE);

    /* Set DI and CS high and apply more than 74 pulses to SCLK for the card */
    /* to be able to accept a native command. */
    sd_sel_spi_mode();
    // sd_deassert_cs();

    PowerFlag = 1;
}

// set the SSI speed to the max setting

void sd_spi_set_max_speed(void) {
    unsigned long i;

    /* Disable the SSI */
    ROM_SSIDisable(SDC_SSI_BASE);

    /* Set the maximum speed as half the system clock, with a max of 20 MHz. */
    i = ROM_SysCtlClockGet() / 2;
    if(i > 12000000)
    {
        i = 12000000;
    }

    /* Configure the SSI0 port to run at 12.5MHz */
    SSIConfigSetExpClk(SDC_SSI_BASE, ROM_SysCtlClockGet(),
                           SSI_FRF_MOTO_MODE_0, SSI_MODE_MASTER, i, 8);

    /* Enable the SSI */
    ROM_SSIEnable(SDC_SSI_BASE);
}


void sd_power_off (void) {
    MAP_SysCtlPeripheralDisable(SDC_SSI_SYSCTL_PERIPH);
    PowerFlag = 0;
}


int sd_chk_power(void) {       /* Socket power state: 0=off, 1=on */
    return PowerFlag;
}



/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/


bool sd_spi_receive_block (
    uint8_t *buff,            /* Data buffer to store received data */
    UINT btr            /* Byte count (must be even number) */
) {
    uint8_t token;
    mp_uint_t start = mp_hal_ticks_ms();
    do {                            /* Wait for data packet in timeout of 100ms */
        token = sd_spi_recieve_byte();
    } while ((token == 0xFF) && (mp_hal_ticks_ms() - start) < 100);
    if(token != 0xFE) return false;    /* If not valid data token, retutn with error */

    do {                            /* Receive the data block into buffer */
        sd_spi_recieve_byte_ptr(buff++);
        sd_spi_recieve_byte_ptr(buff++);
    } while (btr -= 2);
    sd_spi_recieve_byte();                        /* Discard CRC */
    sd_spi_recieve_byte();

    return true;                    /* Return with success */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/
#if _READONLY == 0

bool sd_spi_transmit_block (
    const uint8_t *buff,    /* 512 byte data block to be transmitted */
    uint8_t token            /* Data/Stop token */
) {
    uint8_t resp, wc;
    if (sd_wait_ready() != 0xFF) return false;

    sd_spi_send_byte(token);                    /* Xmit data token */
    if (token != 0xFD) {    /* Is data token */
        wc = 0;
        do {                            /* Xmit the 512 byte data block to MMC */
            sd_spi_send_byte(*buff++);
            sd_spi_send_byte(*buff++);
        } while (--wc);
        sd_spi_send_byte(0xFF);                    /* CRC (Dummy) */
        sd_spi_send_byte(0xFF);
        resp = sd_spi_recieve_byte();                /* Reveive data response */
        if ((resp & 0x1F) != 0x05)        /* If not accepted, return with error */
            return false;
    }

    return true;
}
#endif /* _READONLY */



/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/
uint8_t sd_spi_send_cmd (
    uint8_t cmd,        /* Command byte */
    uint32_t arg        /* Argument */
) {
    uint8_t n, res;
    if (sd_wait_ready() != 0xFF) return 0xFF;

    /* Send command packet */
    sd_spi_send_byte(cmd);                        /* Command */
    sd_spi_send_byte((uint8_t)(arg >> 24));        /* Argument[31..24] */
    sd_spi_send_byte((uint8_t)(arg >> 16));        /* Argument[23..16] */
    sd_spi_send_byte((uint8_t)(arg >> 8));            /* Argument[15..8] */
    sd_spi_send_byte((uint8_t)arg);                /* Argument[7..0] */
    n = 0xff;
    if (cmd == CMD0) n = 0x95;            /* CRC for CMD0(0) */
    if (cmd == CMD8) n = 0x87;            /* CRC for CMD8(0x1AA) */
    if (cmd == CMD41) n = 0x95;
    sd_spi_send_byte(n);

    /* Receive command response */
    if (cmd == CMD12) sd_spi_recieve_byte();        /* Skip a stuff byte when stop reading */
    n = 10;                                /* Wait for a valid response in timeout of 10 attempts */
    do
        res = sd_spi_recieve_byte();
    while ((res & 0x80) && --n);

    return res;            /* Return with the response value */
}

/*-----------------------------------------------------------------------*
 * Send the special command used to terminate a multi-sector read.
 *
 * This is the only command which can be sent while the SDCard is sending
 * data. The SDCard spec indicates that the data transfer will stop 2 bytes
 * after the 6 byte CMD12 command is sent and that the card will then send
 * 0xFF for between 2 and 6 more bytes before the R1 response byte.  This
 * response will be followed by another 0xFF byte.  In testing, however, it
 * seems that some cards don't send the 2 to 6 0xFF bytes between the end of
 * data transmission and the response code.  This function, therefore, merely
 * reads 10 bytes and, if the last one read is 0xFF, returns the value of the
 * latest non-0xFF byte as the response code.
 *
 *-----------------------------------------------------------------------*/
uint8_t sd_spi_send_cmd12 (void) {
    uint8_t n, val;
    uint8_t res = 0;

    /* For CMD12, we don't wait for the card to be idle before we send
     * the new command.
     */

    /* Send command packet - the argument for CMD12 is ignored. */
    sd_spi_send_byte(CMD12);
    sd_spi_send_byte(0);
    sd_spi_send_byte(0);
    sd_spi_send_byte(0);
    sd_spi_send_byte(0);
    sd_spi_send_byte(0);

    /* Read up to 10 bytes from the card, remembering the value read if it's
       not 0xFF */
    for(n = 0; n < 10; n++)
    {
        val = sd_spi_recieve_byte();
        if(val != 0xFF)
        {
            res = val;
        }
    }

    return res;            /* Return with the response value */
}

/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/
DSTATUS sd_disk_init (
    uint8_t drv        /* Physical drive nmuber (0) */
) {
    uint8_t n, ty, ocr[4];
    mp_uint_t start;

